HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxAmu_regdef.h
/**
 * \file IfxAmu_regdef.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Amu_Registers Amu Registers
 * \ingroup IfxSfr
 * 
 * \defgroup IfxSfr_Amu_Registers_Bitfields Bitfields
 * \ingroup IfxSfr_Amu_Registers
 * 
 * \defgroup IfxSfr_Amu_Registers_union Register unions
 * \ingroup IfxSfr_Amu_Registers
 * 
 * \defgroup IfxSfr_Amu_Registers_struct Memory map
 * \ingroup IfxSfr_Amu_Registers
 */
#ifndef IFXAMU_REGDEF_H
#define IFXAMU_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/


/** \addtogroup IfxSfr_Amu_Registers_Bitfields
 * \{  */
/** \brief Control Register 0 */
typedef struct _Ifx_AMU_CTRL0_Bits
{
    Ifx_UReg_32Bit EN:1;              /**< \brief [0:0] Enable Bit - EN (rwh) */
    Ifx_UReg_32Bit ENCN:1;            /**< \brief [1:1] Enable Condition Bit - ENCN (w) */
    Ifx_UReg_32Bit READY:1;           /**< \brief [2:2] Ready Flag - READY (rh) */
    Ifx_UReg_32Bit SDOWN:2;           /**< \brief [4:3] Slowdown Flag - SDOWN (rw) */
    Ifx_UReg_32Bit SDOWNCN:1;         /**< \brief [5:5] Slowdown Condition Bit - SDOWNCN (w) */
    Ifx_UReg_32Bit LI:1;              /**< \brief [6:6] Limit Interrupt - LI (rh) */
    Ifx_UReg_32Bit ERR:1;             /**< \brief [7:7] Error Interrupt - ERR (rh) */
    Ifx_UReg_32Bit LIM2RDY:1;         /**< \brief [8:8] Limit to Ready Interrupt - LIM2RDY (rw) */
    Ifx_UReg_32Bit RDY2LIM:1;         /**< \brief [9:9] Ready to Limit Interrupt - RDY2LIM (rw) */
    Ifx_UReg_32Bit SL:1;              /**< \brief [10:10] Stop on Limit Interrupt - SL (rw) */
    Ifx_UReg_32Bit REGACCEN:1;        /**< \brief [11:11] Allow Register Write when Active - REGACCEN (rw) */
    Ifx_UReg_32Bit MAX:3;             /**< \brief [14:12] Maximum Speed Control - MAX (rw) */
    Ifx_UReg_32Bit MAXCN:1;           /**< \brief [15:15] Maximum Speed Condition Bit - MAXCN (w) */
    Ifx_UReg_32Bit ID:7;              /**< \brief [22:16] Identifier - ID (rw) */
    Ifx_UReg_32Bit IDCN:1;            /**< \brief [23:23] Identifier Condition Bit - IDCN (w) */
    Ifx_UReg_32Bit CSH:1;             /**< \brief [24:24] Current Shaping Enable - CSH (rw) */
    Ifx_UReg_32Bit CSHCN:1;           /**< \brief [25:25] Current Shaping Enable Condition Bit - CSHCN (w) */
    Ifx_UReg_32Bit HSPEED:1;          /**< \brief [26:26] Half Speed - HSPEED (rw) */
    Ifx_UReg_32Bit HSPEEDCN:1;        /**< \brief [27:27] Identifier Condition Bit - HSPEEDCN (w) */
    Ifx_UReg_32Bit reserved_28:2;     /**< \brief [29:28] \internal Reserved */
    Ifx_UReg_32Bit CSHS:2;            /**< \brief [31:30] Current Shaping Status - CSHS (rh) */
} Ifx_AMU_CTRL0_Bits;

/** \brief Control Register 0 Mirror */
typedef struct _Ifx_AMU_CTRL0MIR_Bits
{
    Ifx_UReg_32Bit EN:1;              /**< \brief [0:0] Enable Bit - EN (rh) */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit READY:1;           /**< \brief [2:2] Ready Flag - READY (rh) */
    Ifx_UReg_32Bit SDOWN:2;           /**< \brief [4:3] Slowdown Flag - SDOWN (rh) */
    Ifx_UReg_32Bit reserved_5:1;      /**< \brief [5:5] \internal Reserved */
    Ifx_UReg_32Bit LI:1;              /**< \brief [6:6] Limit Interrupt - LI (rh) */
    Ifx_UReg_32Bit ERR:1;             /**< \brief [7:7] Error Interrupt - ERR (rh) */
    Ifx_UReg_32Bit LIM2RDY:1;         /**< \brief [8:8] Limit to Ready Interrupt - LIM2RDY (rh) */
    Ifx_UReg_32Bit RDY2LIM:1;         /**< \brief [9:9] Ready to Limit Interrupt - RDY2LIM (rh) */
    Ifx_UReg_32Bit SL:1;              /**< \brief [10:10] Stop on Limit Interrupt - SL (rh) */
    Ifx_UReg_32Bit REGACCEN:1;        /**< \brief [11:11] Allow Register Write when Active - REGACCEN (rh) */
    Ifx_UReg_32Bit MAX:3;             /**< \brief [14:12] Maximum Speed Control - MAX (rh) */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit ID:7;              /**< \brief [22:16] Identifier - ID (rh) */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit CSH:1;             /**< \brief [24:24] Current Shaping Enable - CSH (rh) */
    Ifx_UReg_32Bit reserved_25:1;     /**< \brief [25:25] \internal Reserved */
    Ifx_UReg_32Bit HSPEED:1;          /**< \brief [26:26] Half Speed - HSPEED (rh) */
    Ifx_UReg_32Bit reserved_27:3;     /**< \brief [29:27] \internal Reserved */
    Ifx_UReg_32Bit CSHS:2;            /**< \brief [31:30] Current Shaping Status - CSHS (rh) */
} Ifx_AMU_CTRL0MIR_Bits;

/** \brief Control Register 1 */
typedef struct _Ifx_AMU_CTRL1_Bits
{
    Ifx_UReg_32Bit EXPFIX:7;          /**< \brief [6:0] Exponent for Fixed Exponent Format - EXPFIX (rw) */
    Ifx_UReg_32Bit reserved_7:9;      /**< \brief [15:7] \internal Reserved */
    Ifx_UReg_32Bit VFRMT:2;           /**< \brief [17:16] Parameter Matrix V Format - VFRMT (rw) */
    Ifx_UReg_32Bit CFGSET:1;          /**< \brief [18:18] Configuration Set - CFGSET (rw) */
    Ifx_UReg_32Bit reserved_19:13;    /**< \brief [31:19] \internal Reserved */
} Ifx_AMU_CTRL1_Bits;

/** \brief Error Enable Register */
typedef struct _Ifx_AMU_EER_Bits
{
    Ifx_UReg_32Bit P7MAX:1;           /**< \brief [0:0] Enable Interrupt on P7 Over Maximum Error - P7MAX (rw) */
    Ifx_UReg_32Bit IINF:1;            /**< \brief [1:1] Enable Interrupt on Input Infinity Error - IINF (rw) */
    Ifx_UReg_32Bit INAN:1;            /**< \brief [2:2] Enable Interrupt on Input NaN Error - INAN (rw) */
    Ifx_UReg_32Bit OOV:1;             /**< \brief [3:3] Enable Interrupt on Output Overflow - OOV (rw) */
    Ifx_UReg_32Bit ME:1;              /**< \brief [4:4] Enable Interrupt on Memory Error - ME (rw) */
    Ifx_UReg_32Bit REGACC:1;          /**< \brief [5:5] Enable Interrupt on Register Access during Computation Error - REGACC (rw) */
    Ifx_UReg_32Bit DENORM:1;          /**< \brief [6:6] Enable Interrupt on Input Denormalised Number Error - DENORM (rw) */
    Ifx_UReg_32Bit reserved_7:8;      /**< \brief [14:7] \internal Reserved */
    Ifx_UReg_32Bit ECC_STOP:1;        /**< \brief [15:15] Stop on ECC Error - ECC_STOP (r) */
    Ifx_UReg_32Bit reserved_16:6;     /**< \brief [21:16] \internal Reserved */
    Ifx_UReg_32Bit DENEN:1;           /**< \brief [22:22] Enable Stop on Input Denormalised Number Error. - DENEN (rwh) */
    Ifx_UReg_32Bit EECN:1;            /**< \brief [23:23] Enable Stop Condition Bit - EECN (w) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_AMU_EER_Bits;

/** \brief Error Status Register */
typedef struct _Ifx_AMU_ERRSR_Bits
{
    Ifx_UReg_32Bit P7MAX:1;           /**< \brief [0:0] P7 Over Maximum Error - P7MAX (rh) */
    Ifx_UReg_32Bit IINF:1;            /**< \brief [1:1] Input Infinity Error - IINF (rh) */
    Ifx_UReg_32Bit INAN:1;            /**< \brief [2:2] Input NaN Error - INAN (rh) */
    Ifx_UReg_32Bit OOV:1;             /**< \brief [3:3] Output Overflow - OOV (rh) */
    Ifx_UReg_32Bit ME:1;              /**< \brief [4:4] Memory Error - ME (rh) */
    Ifx_UReg_32Bit REGACC:1;          /**< \brief [5:5] Register Access during Computation Error - REGACC (rh) */
    Ifx_UReg_32Bit DENORM:1;          /**< \brief [6:6] Input Denormalised Number Error - DENORM (rh) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit ALGOPOS:4;         /**< \brief [11:8] Algorithm Position - ALGOPOS (rh) */
    Ifx_UReg_32Bit reserved_12:1;     /**< \brief [12:12] \internal Reserved */
    Ifx_UReg_32Bit MEU:1;             /**< \brief [13:13] Uncorrectable Memory Error - MEU (rh) */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit SRI_ECC:1;         /**< \brief [15:15] Uncorrectable Memory Error - SRI_ECC (rh) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_AMU_ERRSR_Bits;

/** \brief Current Coefficient Matrix L Pointer Register */
typedef struct _Ifx_AMU_LCURRPFLOAT_Bits
{
    Ifx_UReg_32Bit LPFLOAT:32;        /**< \brief [31:0] AMU Coefficient Register (Pointer to Float) - LPFLOAT (rh) */
} Ifx_AMU_LCURRPFLOAT_Bits;

/** \brief Coefficient Array L Register */
typedef struct _Ifx_AMU_LPFLOAT_Bits
{
    Ifx_UReg_32Bit LPFLOAT:32;        /**< \brief [31:0] AMU Coefficient Array L (Pointer to Float) - LPFLOAT (rw) */
} Ifx_AMU_LPFLOAT_Bits;

/** \brief Parameter p8 Register */
typedef struct _Ifx_AMU_OLCOMP_Bits
{
    Ifx_UReg_32Bit CP8H2N:16;         /**< \brief [15:0] Trigger Value for switch from half to full speed - CP8H2N (rw) */
    Ifx_UReg_32Bit CPHN2H:16;         /**< \brief [31:16] Trigger Value for switch from full to half speed - CPHN2H (rw) */
} Ifx_AMU_OLCOMP_Bits;

/** \brief Parameter p10 Register */
typedef struct _Ifx_AMU_P10SINT_Bits
{
    Ifx_UReg_32Bit NCROSSING:16;      /**< \brief [15:0] Loop Counter Value to Raise Limit Interrupt - NCROSSING (rw) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_AMU_P10SINT_Bits;

/** \brief Current Parameter p1 Pointer Register */
typedef struct _Ifx_AMU_P1CURRPFLOAT_Bits
{
    Ifx_UReg_32Bit P1PFLOAT:32;       /**< \brief [31:0] AMU Input Vector Register (Pointer to Float) - P1PFLOAT (rh) */
} Ifx_AMU_P1CURRPFLOAT_Bits;

/** \brief Parameter p1 Register */
typedef struct _Ifx_AMU_P1PFLOAT_Bits
{
    Ifx_UReg_32Bit P1PFLOAT:32;       /**< \brief [31:0] AMU P1 Parameter Register (Pointer to Float) - P1PFLOAT (rw) */
} Ifx_AMU_P1PFLOAT_Bits;

/** \brief Current Parameter p2 Pointer Register */
typedef struct _Ifx_AMU_P2CURRPFLOAT_Bits
{
    Ifx_UReg_32Bit P2PFLOAT:32;       /**< \brief [31:0] AMU Input Vector Register (Pointer to Float) - P2PFLOAT (rh) */
} Ifx_AMU_P2CURRPFLOAT_Bits;

