HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxAmu_regdef.h
/** \brief Parameter p2 Register */
typedef struct _Ifx_AMU_P2PFLOAT_Bits
{
    Ifx_UReg_32Bit P2PFLOAT:32;       /**< \brief [31:0] AMU P2 Parameter Register (Pointer to Float) - P2PFLOAT (rw) */
} Ifx_AMU_P2PFLOAT_Bits;

/** \brief Current Parameter p3 Pointer Register */
typedef struct _Ifx_AMU_P3CURRPFLOAT_Bits
{
    Ifx_UReg_32Bit P3PFLOAT:32;       /**< \brief [31:0] AMU Input Vector Register (Pointer to Float) - P3PFLOAT (rh) */
} Ifx_AMU_P3CURRPFLOAT_Bits;

/** \brief Parameter p3 Register */
typedef struct _Ifx_AMU_P3PFLOAT_Bits
{
    Ifx_UReg_32Bit P3PFLOAT:32;       /**< \brief [31:0] AMU P3 Parameter Register (Pointer to Float) - P3PFLOAT (rw) */
} Ifx_AMU_P3PFLOAT_Bits;

/** \brief Parameter p4 Register */
typedef struct _Ifx_AMU_P4FLOAT_Bits
{
    Ifx_UReg_32Bit P4FLOAT:32;        /**< \brief [31:0] AMU P4 Parameter Register (Float) - P4FLOAT (rw) */
} Ifx_AMU_P4FLOAT_Bits;

/** \brief Parameter p5 Register */
typedef struct _Ifx_AMU_P5FLOAT_Bits
{
    Ifx_UReg_32Bit P5FLOAT:32;        /**< \brief [31:0] AMU P5 Parameter Register (Float) - P5FLOAT (rw) */
} Ifx_AMU_P5FLOAT_Bits;

/** \brief Parameter p6 Register */
typedef struct _Ifx_AMU_P6SINT_Bits
{
    Ifx_UReg_32Bit NEND:16;           /**< \brief [15:0] Max Iteration Counter for Outer Loop - NEND (rw) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_AMU_P6SINT_Bits;

/** \brief Parameter p7 Register */
typedef struct _Ifx_AMU_P7SINT_Bits
{
    Ifx_UReg_32Bit M:16;              /**< \brief [15:0] Max Iteration Counter for Inner Loop - M (rw) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_AMU_P7SINT_Bits;

/** \brief Parameter p8 Register */
typedef struct _Ifx_AMU_P8SINT_Bits
{
    Ifx_UReg_32Bit NSTART:16;         /**< \brief [15:0] Start Value for Outer Loop - NSTART (rwh) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_AMU_P8SINT_Bits;

/** \brief Interrupt Status Register */
typedef struct _Ifx_AMU_P8SINTMIR_Bits
{
    Ifx_UReg_32Bit NSTART:16;         /**< \brief [15:0] Start Value for Outer Loop - NSTART (rh) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_AMU_P8SINTMIR_Bits;

/** \brief Parameter p9 Register */
typedef struct _Ifx_AMU_P9DOUBLEHIGH32_Bits
{
    Ifx_UReg_32Bit P9DOUBLE:32;       /**< \brief [31:0] AMU Parameter p9 Register (Double) - P9DOUBLE (rw) */
} Ifx_AMU_P9DOUBLEHIGH32_Bits;

/** \brief Parameter p9 Register */
typedef struct _Ifx_AMU_P9DOUBLELOW32_Bits
{
    Ifx_UReg_32Bit P9DOUBLE:32;       /**< \brief [31:0] AMU Parameter p9 Register (Double) - P9DOUBLE (rw) */
} Ifx_AMU_P9DOUBLELOW32_Bits;

/** \brief Current Input Vector Pointer Register */
typedef struct _Ifx_AMU_UCURRPFLOAT_Bits
{
    Ifx_UReg_32Bit UPFLOAT:32;        /**< \brief [31:0] AMU Input Vector Register (Pointer to Float) - UPFLOAT (rh) */
} Ifx_AMU_UCURRPFLOAT_Bits;

/** \brief Input Vector u Register */
typedef struct _Ifx_AMU_UPFLOAT_Bits
{
    Ifx_UReg_32Bit UPFLOAT:32;        /**< \brief [31:0] AMU Input Vector Register (Pointer to Float) - UPFLOAT (rwh) */
} Ifx_AMU_UPFLOAT_Bits;

/** \brief Current Coefficient Matrix V Pointer Register */
typedef struct _Ifx_AMU_VCURRPFLOAT_Bits
{
    Ifx_UReg_32Bit VPFLOAT:32;        /**< \brief [31:0] AMU V Coefficient Register (Pointer to Float) - VPFLOAT (rh) */
} Ifx_AMU_VCURRPFLOAT_Bits;

/** \brief Coefficient Matrix V Register */
typedef struct _Ifx_AMU_VPFLOAT_Bits
{
    Ifx_UReg_32Bit VPFLOAT:32;        /**< \brief [31:0] AMU V Parameter Register (Pointer to Float) - VPFLOAT (rw) */
} Ifx_AMU_VPFLOAT_Bits;

/** \brief Intermediate Result yRegister */
typedef struct _Ifx_AMU_YDOUBLEHIGH32_Bits
{
    Ifx_UReg_32Bit YDOUBLE:32;        /**< \brief [31:0] AMU v Result Register (Double) - YDOUBLE (rh) */
} Ifx_AMU_YDOUBLEHIGH32_Bits;

/** \brief Intermediate Result yRegister */
typedef struct _Ifx_AMU_YDOUBLELOW32_Bits
{
    Ifx_UReg_32Bit YDOUBLE:32;        /**< \brief [31:0] AMU v Result Register (Double) - YDOUBLE (rh) */
} Ifx_AMU_YDOUBLELOW32_Bits;

/** \brief Intermediate Result y Float Register */
typedef struct _Ifx_AMU_YFLOAT_Bits
{
    Ifx_UReg_32Bit YFLOAT:32;         /**< \brief [31:0] AMU v Result Register (Float) - YFLOAT (rh) */
} Ifx_AMU_YFLOAT_Bits;

/** \brief Return Value Register */
typedef struct _Ifx_AMU_ZDOUBLEHIGH32_Bits
{
    Ifx_UReg_32Bit ZDOUBLE:32;        /**< \brief [31:0] AMU return value z Register (Double) - ZDOUBLE (rh) */
} Ifx_AMU_ZDOUBLEHIGH32_Bits;

/** \brief Return Value Register */
typedef struct _Ifx_AMU_ZDOUBLELOW32_Bits
{
    Ifx_UReg_32Bit ZDOUBLE:32;        /**< \brief [31:0] AMU Return value z Register (Double) - ZDOUBLE (rh) */
} Ifx_AMU_ZDOUBLELOW32_Bits;

/** \brief Return Value Register */
typedef struct _Ifx_AMU_ZFLOAT_Bits
{
    Ifx_UReg_32Bit ZFLOAT:32;         /**< \brief [31:0] AMU Result Register (Float) - ZFLOAT (rh) */
} Ifx_AMU_ZFLOAT_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_amu_Registers_union
 * \{   */
/** \brief Control Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_CTRL0_Bits B;             /**< \brief Bitfield access */
} Ifx_AMU_CTRL0;

/** \brief Control Register 0 Mirror   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_CTRL0MIR_Bits B;          /**< \brief Bitfield access */
} Ifx_AMU_CTRL0MIR;

/** \brief Control Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_CTRL1_Bits B;             /**< \brief Bitfield access */
} Ifx_AMU_CTRL1;

/** \brief Error Enable Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_EER_Bits B;               /**< \brief Bitfield access */
} Ifx_AMU_EER;

/** \brief Error Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_ERRSR_Bits B;             /**< \brief Bitfield access */
} Ifx_AMU_ERRSR;

