HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxAmu_regdef.h
/** \brief Current Coefficient Matrix L Pointer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_LCURRPFLOAT_Bits B;       /**< \brief Bitfield access */
} Ifx_AMU_LCURRPFLOAT;

/** \brief Coefficient Array L Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_LPFLOAT_Bits B;           /**< \brief Bitfield access */
} Ifx_AMU_LPFLOAT;

/** \brief Parameter p8 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_OLCOMP_Bits B;            /**< \brief Bitfield access */
} Ifx_AMU_OLCOMP;

/** \brief Parameter p10 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P10SINT_Bits B;           /**< \brief Bitfield access */
} Ifx_AMU_P10SINT;

/** \brief Current Parameter p1 Pointer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P1CURRPFLOAT_Bits B;      /**< \brief Bitfield access */
} Ifx_AMU_P1CURRPFLOAT;

/** \brief Parameter p1 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P1PFLOAT_Bits B;          /**< \brief Bitfield access */
} Ifx_AMU_P1PFLOAT;

/** \brief Current Parameter p2 Pointer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P2CURRPFLOAT_Bits B;      /**< \brief Bitfield access */
} Ifx_AMU_P2CURRPFLOAT;

/** \brief Parameter p2 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P2PFLOAT_Bits B;          /**< \brief Bitfield access */
} Ifx_AMU_P2PFLOAT;

/** \brief Current Parameter p3 Pointer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P3CURRPFLOAT_Bits B;      /**< \brief Bitfield access */
} Ifx_AMU_P3CURRPFLOAT;

/** \brief Parameter p3 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P3PFLOAT_Bits B;          /**< \brief Bitfield access */
} Ifx_AMU_P3PFLOAT;

/** \brief Parameter p4 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P4FLOAT_Bits B;           /**< \brief Bitfield access */
} Ifx_AMU_P4FLOAT;

/** \brief Parameter p5 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P5FLOAT_Bits B;           /**< \brief Bitfield access */
} Ifx_AMU_P5FLOAT;

/** \brief Parameter p6 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P6SINT_Bits B;            /**< \brief Bitfield access */
} Ifx_AMU_P6SINT;

/** \brief Parameter p7 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P7SINT_Bits B;            /**< \brief Bitfield access */
} Ifx_AMU_P7SINT;

/** \brief Parameter p8 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P8SINT_Bits B;            /**< \brief Bitfield access */
} Ifx_AMU_P8SINT;

/** \brief Interrupt Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P8SINTMIR_Bits B;         /**< \brief Bitfield access */
} Ifx_AMU_P8SINTMIR;

/** \brief Parameter p9 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P9DOUBLEHIGH32_Bits B;    /**< \brief Bitfield access */
} Ifx_AMU_P9DOUBLEHIGH32;

/** \brief Parameter p9 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_P9DOUBLELOW32_Bits B;     /**< \brief Bitfield access */
} Ifx_AMU_P9DOUBLELOW32;

/** \brief Current Input Vector Pointer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_UCURRPFLOAT_Bits B;       /**< \brief Bitfield access */
} Ifx_AMU_UCURRPFLOAT;

/** \brief Input Vector u Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_UPFLOAT_Bits B;           /**< \brief Bitfield access */
} Ifx_AMU_UPFLOAT;

/** \brief Current Coefficient Matrix V Pointer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_VCURRPFLOAT_Bits B;       /**< \brief Bitfield access */
} Ifx_AMU_VCURRPFLOAT;

/** \brief Coefficient Matrix V Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_VPFLOAT_Bits B;           /**< \brief Bitfield access */
} Ifx_AMU_VPFLOAT;

