HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxAmu_regdef.h
/** \brief Intermediate Result yRegister   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_YDOUBLEHIGH32_Bits B;     /**< \brief Bitfield access */
} Ifx_AMU_YDOUBLEHIGH32;

/** \brief Intermediate Result yRegister   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_YDOUBLELOW32_Bits B;      /**< \brief Bitfield access */
} Ifx_AMU_YDOUBLELOW32;

/** \brief Intermediate Result y Float Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_YFLOAT_Bits B;            /**< \brief Bitfield access */
} Ifx_AMU_YFLOAT;

/** \brief Return Value Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_ZDOUBLEHIGH32_Bits B;     /**< \brief Bitfield access */
} Ifx_AMU_ZDOUBLEHIGH32;

/** \brief Return Value Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_ZDOUBLELOW32_Bits B;      /**< \brief Bitfield access */
} Ifx_AMU_ZDOUBLELOW32;

/** \brief Return Value Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AMU_ZFLOAT_Bits B;            /**< \brief Bitfield access */
} Ifx_AMU_ZFLOAT;

/** \}  */

/******************************************************************************/
/** \addtogroup IfxSfr_Amu_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief AMU object */
typedef volatile struct _Ifx_AMU
{
       Ifx_AMU_CTRL1                       CTRL1;                  /**< \brief 0, Control Register 1*/
       Ifx_AMU_EER                         EER;                    /**< \brief 4, Error Enable Register*/
       Ifx_AMU_P10SINT                     P10SINT;                /**< \brief 8, Parameter p10 Register*/
       Ifx_AMU_P6SINT                      P6SINT;                 /**< \brief C, Parameter p6 Register*/
       Ifx_AMU_P7SINT                      P7SINT;                 /**< \brief 10, Parameter p7 Register*/
       Ifx_AMU_P8SINT                      P8SINT;                 /**< \brief 14, Parameter p8 Register*/
       Ifx_AMU_P9DOUBLELOW32               P9DOUBLELOW32;          /**< \brief 18, Parameter p9 Register*/
       Ifx_AMU_P9DOUBLEHIGH32              P9DOUBLEHIGH32;         /**< \brief 1C, Parameter p9 Register*/
       Ifx_AMU_VPFLOAT                     VPFLOAT;                /**< \brief 20, Coefficient Matrix V Register*/
       Ifx_AMU_LPFLOAT                     LPFLOAT;                /**< \brief 24, Coefficient Array L Register*/
       Ifx_AMU_P1PFLOAT                    P1PFLOAT;               /**< \brief 28, Parameter p1 Register*/
       Ifx_AMU_P2PFLOAT                    P2PFLOAT;               /**< \brief 2C, Parameter p2 Register*/
       Ifx_AMU_P3PFLOAT                    P3PFLOAT;               /**< \brief 30, Parameter p3 Register*/
       Ifx_AMU_P4FLOAT                     P4FLOAT;                /**< \brief 34, Parameter p4 Register*/
       Ifx_AMU_P5FLOAT                     P5FLOAT;                /**< \brief 38, Parameter p5 Register*/
       Ifx_AMU_UPFLOAT                     UPFLOAT;                /**< \brief 3C, Input Vector u Register*/
       Ifx_AMU_OLCOMP                      OLCOMP;                 /**< \brief 40, Parameter p8 Register*/
       Ifx_AMU_CTRL0                       CTRL0;                  /**< \brief 44, Control Register 0*/
       Ifx_UReg_8Bit                       reserved_48[56];        /**< \brief 48, \internal Reserved */
       Ifx_AMU_ZDOUBLELOW32                ZDOUBLELOW32;           /**< \brief 80, Return Value Register*/
       Ifx_AMU_ZDOUBLEHIGH32               ZDOUBLEHIGH32;          /**< \brief 84, Return Value Register*/
       Ifx_AMU_ZFLOAT                      ZFLOAT;                 /**< \brief 88, Return Value Register*/
       Ifx_AMU_CTRL0MIR                    CTRL0MIR;               /**< \brief 8C, Control Register 0 Mirror*/
       Ifx_AMU_YDOUBLELOW32                YDOUBLELOW32;           /**< \brief 90, Intermediate Result yRegister*/
       Ifx_AMU_YDOUBLEHIGH32               YDOUBLEHIGH32;          /**< \brief 94, Intermediate Result yRegister*/
       Ifx_AMU_YFLOAT                      YFLOAT;                 /**< \brief 98, Intermediate Result y Float Register*/
       Ifx_AMU_ERRSR                       ERRSR;                  /**< \brief 9C, Error Status Register*/
       Ifx_AMU_P8SINTMIR                   P8SINTMIR;              /**< \brief A0, Interrupt Status Register*/
       Ifx_UReg_8Bit                       reserved_A4[4];         /**< \brief A4, \internal Reserved */
       Ifx_AMU_UCURRPFLOAT                 UCURRPFLOAT;            /**< \brief A8, Current Input Vector Pointer Register*/
       Ifx_AMU_P1CURRPFLOAT                P1CURRPFLOAT;           /**< \brief AC, Current Parameter p1 Pointer Register*/
       Ifx_AMU_P2CURRPFLOAT                P2CURRPFLOAT;           /**< \brief B0, Current Parameter p2 Pointer Register*/
       Ifx_AMU_P3CURRPFLOAT                P3CURRPFLOAT;           /**< \brief B4, Current Parameter p3 Pointer Register*/
       Ifx_AMU_VCURRPFLOAT                 VCURRPFLOAT;            /**< \brief B8, Current Coefficient Matrix V Pointer Register*/
       Ifx_AMU_LCURRPFLOAT                 LCURRPFLOAT;            /**< \brief BC, Current Coefficient Matrix L Pointer Register*/
       Ifx_UReg_8Bit                       reserved_C0[64];        /**< \brief C0, \internal Reserved */
} Ifx_AMU;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXAMU_REGDEF_H */
